/**************************************************************************//*!
 *  @file           hal_sensor_adc_pm.c
 *  @brief          [HAL] SENSOR (ADC) ポテンショメータ・ドライバ API を定義したファイル。
 *************************************************************************** */
#ifdef __cplusplus
    extern "C"{
#endif


//********************************************************
/* include                                               */
//********************************************************
#include "hal_cmn.h"
#include "hal.h"


//#define DBG_PRINT
#define MY_NAME "HAL"
#include "../app/log/log.h"


//********************************************************
/*! @def                                                 */
//********************************************************
// なし


//********************************************************
/*! @enum                                                */
//********************************************************
// なし


//********************************************************
/*! @struct                                              */
//********************************************************
// なし


//********************************************************
/* モジュールグローバル変数                              */
//********************************************************
static SHalSensor_t     g_data;     // センサの値


//********************************************************
/* 関数プロトタイプ宣言                                  */
//********************************************************
static void         InitParam( void );
static EHalBool_t   InitReg( void );
static void         SetOffset( void );




/**************************************************************************//*!
 * @brief     変数を初期化する。
 *************************************************************************** */
static void
InitParam(
    void  ///< [in] ナシ
){
    DBG_PRINT_TRACE( "\n\r" );

    g_data.cur = 0;                 // cur = センサの現在値 ( MCP3208 の AD 値 )
    g_data.ofs = 0;                 // ofs = 初期化時に設定したセンサのオフセット値
    g_data.max = MCP3208_MAX_VALE;  // max = センサの最大値
    g_data.min = MCP3208_MAX_VALE;  // min = センサの最小値
    g_data.err = 0;                 // err = cur - ofs
    g_data.cur_rate = 0;            // cur_rate = ( cur / max ) * 100 ( %  )
    g_data.cur_vol = 0;             // cur_vol = 電圧に換算した現在値 ( mV )

    return;
}


/**************************************************************************//*!
 * @brief     H/W レジスタを初期化する。
 * @attention シングルモードで動作。
 *************************************************************************** */
static EHalBool_t
InitReg(
    void  ///< [in] ナシ
){
    DBG_PRINT_TRACE( "\n\r" );
    return EN_TRUE;
}


/**************************************************************************//*!
 * @brief     センサのオフセット値をセットする。
 *************************************************************************** */
static void
SetOffset(
    void  ///< [in] ナシ
){
    SHalSensor_t*   data;

    DBG_PRINT_TRACE( "\n\r" );

    data = HalSensorPm_Get();
    g_data.ofs = data->cur;

    return;
}


/**************************************************************************//*!
 * @brief     初期化処理
 * @return    EN_TRUE : 初期化成功, EN_FALSE : 初期化失敗
 *************************************************************************** */
EHalBool_t
HalSensorPm_Init(
    void  ///< [in] ナシ
){
    EHalBool_t      ret = EN_FALSE;

    DBG_PRINT_TRACE( "\n\r" );

    InitParam();
    ret = InitReg();
    if( ret == EN_FALSE )
    {
        DBG_PRINT_ERROR( "Unable to initialize spi port. \n\r" );
        return ret;
    }

    SetOffset();
    ret = EN_TRUE;
    return ret;
}


/**************************************************************************//*!
 * @brief     終了処理
 *************************************************************************** */
void
HalSensorPm_Fini(
    void  ///< [in] ナシ
){
    DBG_PRINT_TRACE( "\n\r" );
    return;
}


/**************************************************************************//*!
 * @brief     センサ変数のアドレスを返す。
 * @return    センサ変数のアドレス
 *************************************************************************** */
SHalSensor_t*
HalSensorPm_Get(
    void  ///< [in] ナシ
){
    unsigned int    data = 0;

    DBG_PRINT_TRACE( "\n\r" );

    data = HalCmnSpiMcp3208_Get( EN_MCP3208_CH_7 );

    HalCmn_UpdateSenData( &g_data, (double)data );

    return &g_data;
}


#ifdef __cplusplus
    }
#endif

